In [2]:
import numpy as np
import pandas as pd
pd.DataFrame([['Роман','Малинин']], [0], columns=['name', 'last name'])

    name last name
0  Роман   Малинин

In [3]:
from numpy.random import randn

In [4]:
df = pd.DataFrame(randn(4,3), ['a', 'b', 'c', 'd'], ['X', 'Y', 'Z'])

In [5]:
df

          X         Y         Z
a  0.352837 -0.136167 -0.166634
b -0.238107  0.019741  0.078422
c  0.423879 -1.854223 -1.432348
d -1.377996  0.186749 -1.121744

In [6]:
bool_df = df > 0

In [7]:
bool_df

       X      Y      Z
a   True  False  False
b  False   True   True
c   True  False  False
d  False   True  False

In [8]:
df[bool_df]

          X         Y         Z
a  0.352837       NaN       NaN
b       NaN  0.019741  0.078422
c  0.423879       NaN       NaN
d       NaN  0.186749       NaN

In [14]:
df[df>0]

          X         Y         Z
a  0.352837       NaN       NaN
b       NaN  0.019741  0.078422
c  0.423879       NaN       NaN
d       NaN  0.186749       NaN

In [12]:
df[['Y']] > 1

       Y
a  False
b  False
c  False
d  False

In [16]:
type(df[['Y']])

pandas.core.frame.DataFrame

In [17]:
df[df['Y'] > 1]

Empty DataFrame
Columns: [X, Y, Z]
Index: []

In [18]:
df

          X         Y         Z
a  0.459442 -0.249103 -1.914726
b  1.501404  0.044815  0.441803
c  0.475041  0.012267 -1.287610
d -0.822933 -0.664114 -0.706956

In [19]:
res_df = df[df['X'] < 0]

          X         Y         Z
d -0.822933 -0.664114 -0.706956

In [24]:
res_df = df[df['X'] < 0][['Z', 'X']]
print(res_df)

          Z         X
d -0.706956 -0.822933

In [26]:
df[ (df['X']>0) & (df['Z']<0) ]

          X         Y         Z
a  0.459442 -0.249103 -1.914726
c  0.475041  0.012267 -1.287610

In [27]:
df[ (df['X']>0) | (df['Z']<0) ]

          X         Y         Z
a  0.459442 -0.249103 -1.914726
b  1.501404  0.044815  0.441803
c  0.475041  0.012267 -1.287610
d -0.822933 -0.664114 -0.706956

In [34]:
df.reset_index(inplace=True)

In [35]:
df

  index         X         Y         Z
0     a -1.168939 -0.580239  0.198022
1     b -0.622252 -0.041578  2.056706
2     c -0.083165 -0.480135 -0.426255
3     d  1.052266  0.141191 -0.122753

In [36]:
z1 = [2,3,5,6]

In [37]:
df['Z1'] = z1

In [38]:
df

  index         X         Y         Z  Z1
0     a -1.168939 -0.580239  0.198022   2
1     b -0.622252 -0.041578  2.056706   3
2     c -0.083165 -0.480135 -0.426255   5
3     d  1.052266  0.141191 -0.122753   6

In [40]:
df.set_index('Z1', inplace=True)

   index         X         Y         Z
Z1
2      a -1.168939 -0.580239  0.198022
3      b -0.622252 -0.041578  2.056706
5      c -0.083165 -0.480135 -0.426255
6      d  1.052266  0.141191 -0.122753

ДЗ

In [45]:
dataFrame = pd.DataFrame(np.random.randint(1,101, 20).reshape(5,4), 
                         [10,20,30,40,50], ['A', 'B', 'C', 'D'])

In [46]:
dataFrame

     A   B   C   D
10  45  12  40  28
20  20  55  76  65
30  91  67  79  25
40  69  88  70  35
50  32  41  60  57

In [49]:
dataFrame[dataFrame['A'] < 30]

     A   B   C   D
20  20  55  76  65

In [52]:
dataFrame[(dataFrame['A'] < 50) | (dataFrame['B']<40)]

     A   B   C   D
10  45  12  40  28
20  20  55  76  65
50  32  41  60  57

In [53]:
dataFrame[(dataFrame['C']>20) & dataFrame['D']<70][['A', 'C']]

     A   C
10  45  40
20  20  76
30  91  79
40  69  70
50  32  60